#1. При помощи класса описать сравнение строк любым методом
#2. Объект - экземпляр класса должен принимать 2 аргумента - строки для сравнения
#3. Метод сравнения должен возвращать степень похожести (как в примерах)
#4. Создать в __name__ == '__main__' экземпляр класса и вызвать его метод сравнения для строк из списка (как в примере)

from ex4_1Compare import Sr

pairs = [
	('kitten', 'sitting'),
	('saturday', 'sunday'),
	('море', 'гора'),
	('компьютер', 'компьютеризация'),
	('компьютер', 'компьютеры'),
	]

if __name__ == "__main__":
	sr = Sr()
	for s, t, in pairs:
		print(s, t, sr.compare(s, t))
